#include <stdio.h>
#include<stdlib.h>
int main()
{
	//short a = 0100;  //八进制
	//int b = -0x1;  //十六进制
	//long c = 720;  //十进制

	//unsigned short m = 0xffff;  //十六进制
	//unsigned int n = 0x80000000;  //十六进制
	//unsigned long p = 100;  //十进制

	////以无符号的形式输出有符号数
	//printf("a=%#ho, b=%#x, c=%ld\n", a, b, c); //%o %x输出的是有无符号数
	////以有符号数的形式输出无符号类型（只能以十进制形式输出）
	//printf("m=%hd, n=%d, p=%ld\n", m, n, p);
	/*
		b = -0x1
	= [1000 0000 …… 0000 0001]原
	= [1111 1111 …… 1111 1110]反
	= [1111 1111 …… 1111 1111]补
	= [0xffffffff]补 printf %x 无符号输出所以为 0xffffffff

		m=0xffff
	=[1111 1111 1111 1111]补
	= [1111 1111 1111 1110]反
	= [1000 0000 0000 0001]原
	= -1

		n= 0x80000000
	=[1000 0000 …… 0000 0000]补
	= -2^31
	= -2147483648
	*/
	unsigned int a = 0x100000000;
	int b = 0xffffffff;
	printf("a=%u, b=%d\n", a, b); 
	/*
			a发生高位溢出
			[1 0000 0000 .....   0000]
		=1溢出
		=0

			[1111 1111 …… 1111 1111]补
		= [1111 1111 …… 1111 1110]反
		= [1000 0000 …… 0000 0001]原
		= -1
	*/
	system("pause");
	return 0;
}